# Targeting plugin version: 1.3.3
# Encoding: UTF-16LE
# Please edit this file using VS Code or any other editors that support editing file in UTF-16LE encoding, make sure to open this file and edit with UTF-16LE encoding.

[FL_Main]
Name=浮动歌词插件
Abbreviation=浮动歌词
Toggle=切换
Warning=警告

[FL_Preference]
ResetDimension=重置本窗口大小
Preference=偏好
PlayStyleGroupTitle=播放样式
PlayStyleOption=歌词播放样式
PlayStyle_FadeInOut=淡入淡出
PlayStyle_HScroll=水平滚动
PlayStyle_TwoLine=双行歌词
Opacity=不透明度
InactiveOpacityOption=未激活歌词不透明度
FadeDuration=淡入/淡出动画最大持续时间
FadeDurationDescription=若将其设为0，不会有淡入淡出动画，就像是在播放电影字幕
LetterSpacingAnimationSpeed=文本间距动画速度
LetterSpacingAnimationSpeedDescription=若将其设为非零值，水平滚动会被禁用，文本间距则会被动画
TwoLinePlacement=双行摆放
TwoLinePlacement_OppositeEdge=一左一右
TwoLinePlacement_OppositeEdgeReverse=一右一左
TwoLinePlacement_Center=居中
TwoLineVerticalGap=双行间距

WhenUnSyncedLyricsFound=当歌词无时间戳时
WhenUnSyncedLyricsFound_DoNotShow=不要展示
WhenUnSyncedLyricsFound_Play=使用当前的播放样式播放
WhenUnSyncedLyricsFound_StackVertically=垂直堆放
WhenUnSyncedLyricsFound_StackHorizontally=水平堆放

TextShadowGroupTitle=文字阴影设置
EnableAsk=是否启用？
ShadowImpl=阴影实现 (高级)
ShadowImplDescription=卡拉OK模式仅支持渲染阴影的"描边"实现
Automatic=自动
Recommended=推荐
TextShadowImpl=文本
StrokeShadowImpl=描边
BothImpl=同时启用
Color=颜色
OffsetX=水平偏移
OffsetY=垂直偏移
BlurRadius=模糊
StrokeShadowGroupTitle=描边阴影设置
StrokeShadowGroupHint=描边阴影能更好地兼容文字描边

TextStrokeGroupTitle=文字描边设置
TextStrokeThickness=粗细
TextStrokeOutside=使用外描边
TextStrokeOutsideDescription=外描边渲染于文本颜色之外，内描边则相反；\n卡拉OK模式下无法渲染内描边，该模式下总是启用此项

FontSettingsGroupTitle=字体设置
FontLatin=英文字体
FontMain=主字体
FontSize=大小
Weight=加粗
LetterSpacing=文字间距

WindowSettingsGroupTitle=窗口设置
BackgroundColor=背景色
EdgeFeatherWidth=边缘羽化宽度
ClickThrough=点击透过
AlwaysHideTaskbar=始终在任务栏隐藏
AlwaysHideTaskbarDescription=若启用此选项，在您点击AIMP播放器右上角最小化按钮时浮动歌词窗口也会被最小化，为了避免这个情况，您可以通过这些方式来最小化播放器：\n1. 托盘右键菜单 - "最小化到托盘";\n2. 或者将托盘的任意“鼠标控制(比如单击)”更改为“显示/隐藏主窗口”，然后通过对应的操作来最小化播放器。
HideWhenNoLyrics=若无歌词隐藏
ShowOnTopmost=总是于顶层展示
Off=禁用
On=启用

MiscellaneousGroupTitle=杂项
Show=显示
Hide=隐藏

KaraokeGroupTitle=卡拉OK模式设置
KaraokeEnableAsk=是否启用卡拉OK模式？
KaraokeEnableAskDescription=更多该模式配置于其它面板中展示
KaraokeSpecific=卡拉OK模式特色配置项
KaraokeTransitionWidth=卡拉OK模式过渡区宽度

Save=保存并应用
Apply=应用
Cancel=取消

Unit_px=（像素）
Unit_ch=（字符）
Unit_px_per_s=（像素/秒）
Unit_ms=（毫秒）

[LyricsEditor]
Name=歌词编辑器
RestoreAsk=您之前对当前歌曲有未保存编辑，要恢复吗？

ArtistPlaceholder=歌曲的演唱歌手
ComposerPlaceholder=作曲
Length=歌曲长度
LengthPlaceholder=曲目长度，以 mm:ss
Offset=偏移
OffsetPlaceholder=同步歌词偏移时间，以毫秒计。其值前缀 “+” 或 “-”，其中，“+” 使歌词提前
By=lrc制作
ByPlaceholder=lrc文件制作者

LyricsLines=歌词行
Insert=插入
InsertTimestamp=插入时间戳
InsertTimestampDetail=插入本行时间戳
Replace=替换
ReplaceTimestamp=替换时间戳
ReplaceTimestampDetail=替换本行时间戳
Remove=删除
RemoveTimestamp=删除时间戳
RemoveTimestampDetail=删除本行时间戳
IncreaseFontSize=增加字号
DecreaseFontSize=减少字号
Replay=重放正编辑的歌曲
Resume=继续播放
Pause=暂停播放
Backward=回退{0}秒
Forward=前进{0}秒

CondensedAsk=压缩歌词？
CondensedAskDescription=若启用，保存后的歌词文件中具有相同歌词的行会被合并到同一行
SaveLyrics=保存歌词……
Success=成功
SuccessSaveMsg=歌词文件已被保存至 {0} ！
Failure=失败
FailureSaveMsg=无法将歌词文件保存至 {0}，错误信息 {1}

[LyricsPlayingWindow]
StartEditLyrics=制作/编辑歌词
ResetPositionAndDimension=重置窗口状态
CenterHorizontally=水平居中窗口
EnableResizing=启用窗口尺寸调整
DisableResizing=禁用窗口尺寸调整
OpenPreference=偏好设置……
WebViewNotInstalled=您的系统没有安装 Edge WebView2, 您要去下载吗?
WebViewNotInstalled2=您的系统没有安装 Edge WebView2, 插件不会工作的啦 >.<, 您可以从这里下载并安装
WebViewLowVersion=您在使用一个较低版本的Edge WebView2({0} < 124), 这可能导致浮动歌词插件不能正常工作。您可以尝试更新您的Edge浏览器。
WebViewNavigationFailure=Edge WebView2 加载失败 >.< 检查您是否正确拷贝了插件的文件。如果问题始终存在，请联系开发者，谢谢！

[FL_OptionFrame]
BtnOpenPreferenceWindow=打开偏好设置窗口
BtnResetLyricsWindowLocation=重置浮动歌词窗口状态
BtnDisableClickThrough=禁用浮动歌词窗口点击透过

[FL_IssueMessage]
DotnetNotInstalled=.NET桌面应用运行时 {0} 未安装 >.<\n 要带您去下载吗？({1})
LoadFailure=插件加载失败！错误代码：0x{0}\n请确认：\n1. .NET桌面应用运行时 {1} 是否正确安装;\n2. 是否与其它插件冲突？\n如果问题始终存在，您可以在AIMP论坛或者Github上联系开发者({2})，谢谢！
